obitvn/ccu_xgw_ti_can/ccu_ti_multi_core_freertos/example.syscfg
section14.load_memory                 = "OCRAM";
section14.$name                       = "ENET DMA Packet Memory Pool";
section14.group                       = false;
section14.type                        = "NOLOAD";
section14.output_section.create(1);
section14.output_section[0].$name     = ".bss:ENET_DMA_PKT_MEMPOOL";
section14.output_section[0].alignment = 128;

enet_cpsw1.$name                              = "CONFIG_ENET_CPSW0";
enet_cpsw1.PktInfoOnlyEnable                  = true;
enet_cpsw1.BoardType                          = "am263px-lp";
enet_cpsw1.cptsHostRxTsEn                     = false;
enet_cpsw1.macOnlyEn_macPort2                 = true;
enet_cpsw1.macOnlyEn_macPort1                 = true;
enet_cpsw1.macOnlyEn_hostPort                 = true;
enet_cpsw1.macAddrConfig                      = "Manual Entry";
enet_cpsw1.SmallPoolPktSize                   = 512;
enet_cpsw1.LargePoolPktCount                  = 64;
enet_cpsw1.RGMII1.$assign                     = "RGMII1";
enet_cpsw1.RGMII2.$assign                     = "RGMII2";
enet_cpsw1.txDmaChannel[0].$name              = "ENET_DMA_TX_CH0";
enet_cpsw1.rxDmaChannel[0].$name              = "ENET_DMA_RX_CH0";
enet_cpsw1.netifInstance.create(1);
enet_cpsw1.netifInstance[0].$name             = "NETIF_INST_ID0";
enet_cpsw1.netifInstance[0].packetDequeueMode = "INTERRUPT";

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_cpsw1.ethphy1       = ethphy_cpsw_icssg1;

const ethphy_cpsw_icssg2 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg2.$name = "CONFIG_ENET_ETHPHY1";
enet_cpsw1.ethphy2       = ethphy_cpsw_icssg2;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.$suggestSolution                 = "I2C1";
i2c1.I2C.SCL.$suggestSolution             = "I2C1_SCL";
i2c1.I2C.SDA.$suggestSolution             = "I2C1_SDA";
enet_cpsw1.MDIO.$suggestSolution          = "MDIO";
enet_cpsw1.MDIO.MDC.$suggestSolution      = "MDIO_MDC";
enet_cpsw1.MDIO.MDIO.$suggestSolution     = "MDIO_MDIO";
enet_cpsw1.RGMII1.RD0.$suggestSolution    = "RGMII1_RD0";
enet_cpsw1.RGMII1.RD1.$suggestSolution    = "RGMII1_RD1";
enet_cpsw1.RGMII1.RD2.$suggestSolution    = "RGMII1_RD2";
enet_cpsw1.RGMII1.RD3.$suggestSolution    = "RGMII1_RD3";
enet_cpsw1.RGMII1.RX_CTL.$suggestSolution = "RGMII1_RX_CTL";
enet_cpsw1.RGMII1.RXC.$suggestSolution    = "RGMII1_RXC";
enet_cpsw1.RGMII1.TD0.$suggestSolution    = "RGMII1_TD0";
enet_cpsw1.RGMII1.TD1.$suggestSolution    = "RGMII1_TD1";
enet_cpsw1.RGMII1.TD2.$suggestSolution    = "RGMII1_TD2";
enet_cpsw1.RGMII1.TD3.$suggestSolution    = "RGMII1_TD3";
enet_cpsw1.RGMII1.TX_CTL.$suggestSolution = "RGMII1_TX_CTL";
enet_cpsw1.RGMII1.TXC.$suggestSolution    = "RGMII1_TXC";
enet_cpsw1.RGMII2.RD0.$suggestSolution    = "PR0_PRU0_GPIO0";
enet_cpsw1.RGMII2.RD1.$suggestSolution    = "PR0_PRU0_GPIO1";
enet_cpsw1.RGMII2.RD2.$suggestSolution    = "PR0_PRU0_GPIO2";
enet_cpsw1.RGMII2.RD3.$suggestSolution    = "PR0_PRU0_GPIO3";
enet_cpsw1.RGMII2.RX_CTL.$suggestSolution = "PR0_PRU0_GPIO4";
enet_cpsw1.RGMII2.RXC.$suggestSolution    = "PR0_PRU0_GPIO6";
enet_cpsw1.RGMII2.TD0.$suggestSolution    = "PR0_PRU0_GPIO11";
enet_cpsw1.RGMII2.TD1.$suggestSolution    = "PR0_PRU0_GPIO12";
enet_cpsw1.RGMII2.TD2.$suggestSolution    = "PR0_PRU0_GPIO13";
enet_cpsw1.RGMII2.TD3.$suggestSolution    = "PR0_PRU0_GPIO14";
enet_cpsw1.RGMII2.TX_CTL.$suggestSolution = "PR0_PRU0_GPIO15";
enet_cpsw1.RGMII2.TXC.$suggestSolution    = "PR0_PRU0_GPIO16";
